#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```

data.oci_identity_availability_domains.ads: Reading...
oci_budget_budget.stack_budget: Refreshing state... [id=ocid1.budget.oc1.iad.amaaaaaazrydlxyarasyzmsom2pja3kuvnaiu4z54ktmzx77h35b7baosh5a]
oci_load_balancer_load_balancer.k3s_lb: Refreshing state... [id=ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq]
oci_bastion_bastion.k3s_bastion: Refreshing state... [id=ocid1.bastion.oc1.iad.amaaaaaazrydlxyavabvfzu6usiejua65ef3fkugpg5blmh6rhdhvh6ozlpq]
oci_waf_web_app_firewall_policy.k3s_waf_policy: Refreshing state... [id=ocid1.webappfirewallpolicy.oc1.iad.amaaaaaazrydlxyagtpnoo3znk4iz6lwneo55zzezvzkd4on7mpa2omaronq]
oci_core_instance.k3s_instance: Refreshing state... [id=ocid1.instance.oc1.iad.anuwcljszrydlxycucjtok26faxzdaxu5s3apmygqaej5kq7n5oh5vjxunpq]
oci_mysql_mysql_db_system.grafana_db: Refreshing state... [id=ocid1.mysqldbsystem.oc1.iad.aaaaaaaadclranruehn3mg7wd3xbfpb53bebcaz66pyz2drn6ndbphx6dw7q]
data.oci_identity_availability_domains.ads: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-1063911866]
oci_load_balancer_backend_set.k3s_backend_set: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq/backendSets/k3s-backend-set]
oci_load_balancer_backend_set.k3s_backend_set_443: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq/backendSets/k3s-backend-set-443]
oci_waf_web_app_firewall.k3s_waf: Refreshing state... [id=ocid1.webappfirewall.oc1.iad.amaaaaaazrydlxya5fte37a3vjaldjuzxk3xjemvr4ps7lfmblhz2dnm2fsa]
oci_load_balancer_listener.k3s_listener_80: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq/listeners/http-listener]
oci_budget_alert_rule.stack_budget_alert: Refreshing state... [id=ocid1.alertrule.oc1.iad.amaaaaaazrydlxyacdt64pnuwjp7ciqsyrffx4zffx6mcymtq5rsqwmncgzq]
oci_load_balancer_listener.k3s_listener_443: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq/listeners/https-listener]
oci_load_balancer_backend.k3s_backend_80: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq/backendSets/k3s-backend-set/backends/10.0.0.165:80]
oci_load_balancer_backend.k3s_backend_443: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq/backendSets/k3s-backend-set-443/backends/10.0.0.165:443]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_monitoring_alarm.high_cpu_alarm will be created
  + resource "oci_monitoring_alarm" "high_cpu_alarm" {
      + alarm_summary                                 = (known after apply)
      + body                                          = "Critical: K3s instance CPU has exceeded 80% for 5 minutes."
      + compartment_id                                = "ocid1.tenancy.oc1..aaaaaaaa3gi23m2ydmg7xa46xsae4wa2mmcmkshncwgt7zldhc3eamb3ovzq"
      + defined_tags                                  = (known after apply)
      + destinations                                  = (known after apply)
      + display_name                                  = "k3s-high-cpu-alarm"
      + evaluation_slack_duration                     = (known after apply)
      + freeform_tags                                 = (known after apply)
      + id                                            = (known after apply)
      + is_enabled                                    = true
      + is_notifications_per_metric_dimension_enabled = (known after apply)
      + message_format                                = (known after apply)
      + metric_compartment_id                         = "ocid1.tenancy.oc1..aaaaaaaa3gi23m2ydmg7xa46xsae4wa2mmcmkshncwgt7zldhc3eamb3ovzq"
      + metric_compartment_id_in_subtree              = (known after apply)
      + namespace                                     = "oci_computeagent"
      + notification_title                            = (known after apply)
      + notification_version                          = (known after apply)
      + pending_duration                              = "PT5M"
      + query                                         = "CpuUtilization[1m].mean() > 80"
      + repeat_notification_duration                  = (known after apply)
      + resolution                                    = (known after apply)
      + resource_group                                = (known after apply)
      + rule_name                                     = (known after apply)
      + severity                                      = "CRITICAL"
      + state                                         = (known after apply)
      + time_created                                  = (known after apply)
      + time_updated                                  = (known after apply)

      + overrides (known after apply)

      + suppression (known after apply)
    }

  # oci_monitoring_alarm.lb_health_alarm will be created
  + resource "oci_monitoring_alarm" "lb_health_alarm" {
      + alarm_summary                                 = (known after apply)
      + body                                          = "Critical: Load Balancer detects that the K3s instance is not responding (Health Check failed)."
      + compartment_id                                = "ocid1.tenancy.oc1..aaaaaaaa3gi23m2ydmg7xa46xsae4wa2mmcmkshncwgt7zldhc3eamb3ovzq"
      + defined_tags                                  = (known after apply)
      + destinations                                  = (known after apply)
      + display_name                                  = "k3s-lb-unhealthy"
      + evaluation_slack_duration                     = (known after apply)
      + freeform_tags                                 = (known after apply)
      + id                                            = (known after apply)
      + is_enabled                                    = true
      + is_notifications_per_metric_dimension_enabled = (known after apply)
      + message_format                                = (known after apply)
      + metric_compartment_id                         = "ocid1.tenancy.oc1..aaaaaaaa3gi23m2ydmg7xa46xsae4wa2mmcmkshncwgt7zldhc3eamb3ovzq"
      + metric_compartment_id_in_subtree              = (known after apply)
      + namespace                                     = "oci_lbaas"
      + notification_title                            = (known after apply)
      + notification_version                          = (known after apply)
      + pending_duration                              = "PT1M"
      + query                                         = "UnHealthyBackendServers[1m].max() > 0"
      + repeat_notification_duration                  = (known after apply)
      + resolution                                    = (known after apply)
      + resource_group                                = (known after apply)
      + rule_name                                     = (known after apply)
      + severity                                      = "CRITICAL"
      + state                                         = (known after apply)
      + time_created                                  = (known after apply)
      + time_updated                                  = (known after apply)

      + overrides (known after apply)

      + suppression (known after apply)
    }

  # oci_ons_notification_topic.k3s_alerts will be created
  + resource "oci_ons_notification_topic" "k3s_alerts" {
      + api_endpoint   = (known after apply)
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa3gi23m2ydmg7xa46xsae4wa2mmcmkshncwgt7zldhc3eamb3ovzq"
      + defined_tags   = (known after apply)
      + description    = "Infrastructure alerts for K3s cluster"
      + etag           = (known after apply)
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + name           = "k3s-infra-alerts"
      + short_topic_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + topic_id       = (known after apply)
    }

  # oci_ons_subscription.k3s_alerts_email will be created
  + resource "oci_ons_subscription" "k3s_alerts_email" {
      + compartment_id  = "ocid1.tenancy.oc1..aaaaaaaa3gi23m2ydmg7xa46xsae4wa2mmcmkshncwgt7zldhc3eamb3ovzq"
      + created_time    = (known after apply)
      + defined_tags    = (known after apply)
      + delivery_policy = (known after apply)
      + endpoint        = (sensitive value)
      + etag            = (known after apply)
      + freeform_tags   = (known after apply)
      + id              = (known after apply)
      + protocol        = "EMAIL"
      + state           = (known after apply)
      + topic_id        = (known after apply)
    }

  # oci_ons_subscription.k3s_alerts_slack will be created
  + resource "oci_ons_subscription" "k3s_alerts_slack" {
      + compartment_id  = "ocid1.tenancy.oc1..aaaaaaaa3gi23m2ydmg7xa46xsae4wa2mmcmkshncwgt7zldhc3eamb3ovzq"
      + created_time    = (known after apply)
      + defined_tags    = (known after apply)
      + delivery_policy = (known after apply)
      + endpoint        = (sensitive value)
      + etag            = (known after apply)
      + freeform_tags   = (known after apply)
      + id              = (known after apply)
      + protocol        = "SLACK"
      + state           = (known after apply)
      + topic_id        = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>